import React, {Component} from 'react'
import './index.scss'
import TopicItem from './components/TopicItem'

export default class extends Component {
  render () {
    return (
      <div className='conference--topic'>
        <div className='topic--title'>大会专题</div>
        <div className='topic--body'>
          <div className='topic--row'>
            <TopicItem iconClass={'icon-zhuhuichang'} title={'主会场'} content={'        Gartner发布的2017年十项重大科技发展趋势，人工智能、物联网、区块链名列其中；三大科技与大数据技术结合，降低了大数据应用门槛，让大数据成为开启智能化生活的有效工具；人工智能驱动下的智能驾驶使驾车出行更安全，各大互联网巨头纷纷加大筹码，将其确定为重要战略方向；互联网教育作为新兴教育模式，广受教育机构及学员追捧,主会场将聚焦IT行业最热门技术，力邀优秀技术领袖，把脉最新发展趋势，深度分享经典应用案例。\n'}/>
            <TopicItem iconClass={'icon-zhuhuichang'} title={'主会场'} content={'        Gartner发布的2017年十项重大科技发展趋势，人工智能、物联网、区块链名列其中；三大科技与大数据技术结合，降低了大数据应用门槛，让大数据成为开启智能化生活的有效工具；人工智能驱动下的智能驾驶使驾车出行更安全，各大互联网巨头纷纷加大筹码，将其确定为重要战略方向；互联网教育作为新兴教育模式，广受教育机构及学员追捧,主会场将聚焦IT行业最热门技术，力邀优秀技术领袖，把脉最新发展趋势，深度分享经典应用案例。\n'}/>
            <TopicItem iconClass={'icon-zhuhuichang'} title={'主会场'} content={'        Gartner发布的2017年十项重大科技发展趋势，人工智能、物联网、区块链名列其中；三大科技与大数据技术结合，降低了大数据应用门槛，让大数据成为开启智能化生活的有效工具；人工智能驱动下的智能驾驶使驾车出行更安全，各大互联网巨头纷纷加大筹码，将其确定为重要战略方向；互联网教育作为新兴教育模式，广受教育机构及学员追捧,主会场将聚焦IT行业最热门技术，力邀优秀技术领袖，把脉最新发展趋势，深度分享经典应用案例。\n'}/>
          </div>
          
          <div className='topic--row'>
            <TopicItem iconClass={'icon-zhuhuichang'} title={'主会场'} content={'        Gartner发布的2017年十项重大科技发展趋势，人工智能、物联网、区块链名列其中；三大科技与大数据技术结合，降低了大数据应用门槛，让大数据成为开启智能化生活的有效工具；人工智能驱动下的智能驾驶使驾车出行更安全，各大互联网巨头纷纷加大筹码，将其确定为重要战略方向；互联网教育作为新兴教育模式，广受教育机构及学员追捧,主会场将聚焦IT行业最热门技术，力邀优秀技术领袖，把脉最新发展趋势，深度分享经典应用案例。\n'}/>
            <TopicItem iconClass={'icon-zhuhuichang'} title={'主会场'} content={'        Gartner发布的2017年十项重大科技发展趋势，人工智能、物联网、区块链名列其中；三大科技与大数据技术结合，降低了大数据应用门槛，让大数据成为开启智能化生活的有效工具；人工智能驱动下的智能驾驶使驾车出行更安全，各大互联网巨头纷纷加大筹码，将其确定为重要战略方向；互联网教育作为新兴教育模式，广受教育机构及学员追捧,主会场将聚焦IT行业最热门技术，力邀优秀技术领袖，把脉最新发展趋势，深度分享经典应用案例。\n'}/>
            <TopicItem iconClass={'icon-zhuhuichang'} title={'主会场'} content={'        Gartner发布的2017年十项重大科技发展趋势，人工智能、物联网、区块链名列其中；三大科技与大数据技术结合，降低了大数据应用门槛，让大数据成为开启智能化生活的有效工具；人工智能驱动下的智能驾驶使驾车出行更安全，各大互联网巨头纷纷加大筹码，将其确定为重要战略方向；互联网教育作为新兴教育模式，广受教育机构及学员追捧,主会场将聚焦IT行业最热门技术，力邀优秀技术领袖，把脉最新发展趋势，深度分享经典应用案例。\n'}/>
          </div>
          
          <div className='topic--row'>
            <TopicItem iconClass={'icon-zhuhuichang'} title={'主会场'} content={'        Gartner发布的2017年十项重大科技发展趋势，人工智能、物联网、区块链名列其中；三大科技与大数据技术结合，降低了大数据应用门槛，让大数据成为开启智能化生活的有效工具；人工智能驱动下的智能驾驶使驾车出行更安全，各大互联网巨头纷纷加大筹码，将其确定为重要战略方向；互联网教育作为新兴教育模式，广受教育机构及学员追捧,主会场将聚焦IT行业最热门技术，力邀优秀技术领袖，把脉最新发展趋势，深度分享经典应用案例。\n'}/>
            <TopicItem iconClass={'icon-zhuhuichang'} title={'主会场'} content={'        Gartner发布的2017年十项重大科技发展趋势，人工智能、物联网、区块链名列其中；三大科技与大数据技术结合，降低了大数据应用门槛，让大数据成为开启智能化生活的有效工具；人工智能驱动下的智能驾驶使驾车出行更安全，各大互联网巨头纷纷加大筹码，将其确定为重要战略方向；互联网教育作为新兴教育模式，广受教育机构及学员追捧,主会场将聚焦IT行业最热门技术，力邀优秀技术领袖，把脉最新发展趋势，深度分享经典应用案例。\n'}/>
            <TopicItem iconClass={'icon-zhuhuichang'} title={'主会场'} content={'        Gartner发布的2017年十项重大科技发展趋势，人工智能、物联网、区块链名列其中；三大科技与大数据技术结合，降低了大数据应用门槛，让大数据成为开启智能化生活的有效工具；人工智能驱动下的智能驾驶使驾车出行更安全，各大互联网巨头纷纷加大筹码，将其确定为重要战略方向；互联网教育作为新兴教育模式，广受教育机构及学员追捧,主会场将聚焦IT行业最热门技术，力邀优秀技术领袖，把脉最新发展趋势，深度分享经典应用案例。\n'}/>
          </div>
        </div>
      </div>
    )
  }
}